Revit 2027 API
BackClippingParam Enumeration
 The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BackClippingParam
Public Enumeration BackClippingParam
public enum class BackClippingParam
type BackClippingParam
Members
Member name | Value | Description
ClipNoLine | 2 |  Clip without line.
ClipWithLine | 1 |  Clip with line.
NoClip | 0 |  No clip
See Also
Reference
Autodesk.Revit.DB Namespace